Repository: j4321/Sudoku-Tk
Catalog: po/*.po
Languages: fr

source: Open
fr: Ouvrir

source: Save As
fr: Enregistrer sous

source: This software has been developped using Tcl/Tk 8.6, but you are using an older version. Therefore there might be errors. Please consider upgrading your Tcl/Tk version.
fr: Ce logiciel a été développé avec Tcl/Tk 8.6, mais vous utilisez une version plus ancienne. De ce fait, il peut y avoir des erreurs. Il est conseillé de mettre à jour Tcl/Tk.

source: Do not show this message again.
fr: Ne plus montrer ce message.

source: Pause game
fr: Mettre en pause

source: Restart game
fr: Recommencer

source: Undo
fr: Annuler

source: Redo
fr: Répéter

source: Level
fr: Niveau

source: Unknown
fr: Inconnu

source: Easy
fr: Facile

source: Medium
fr: Moyen

source: Difficult
fr: Difficile

source: Generate a puzzle
fr: Générer une grille

source: Empty grid
fr: Grille vide

source: Game
fr: Jeu

source: Puzzle
fr: Grille

source: Restart
fr: Recommencer

source: Solve
fr: Résoudre

source: Save
fr: Enregistrer

source: Export
fr: Exporter

source: Evaluate level
fr: Évaluer le niveau

source: Help
fr: Aide

source: About
fr: À propos

source: New
fr: Nouveau

source: Language
fr: Langue

source: Statistics
fr: Statistiques

source: Error
fr: Erreur

source: The file %(file)r does not exist.
fr: Le fichier %(file)r n'existe pas.

source: This file is not a valid sudoku file.
fr: Ce fichier n'est pas un fichier de sudoku valide.

source: Best times
fr: Meilleurs temps

source: Close
fr: Fermer

source: Clear
fr: Effacer

source: The language setting will take effect after restarting the application
fr: Le changement de langue prendra effet au prochain démarrage.

source: Yes
fr: Oui

source: Do you want to interrupt the current puzzle?
fr: Voulez-vous interrompre le sudoku en cours ?

source: No
fr: Non

source: Resume game
fr: Reprendre

source: You solved the puzzle in %(min)i minutes and %(sec)i secondes.
fr: Vous avez résolu ce sudoku en %(min)i minutes et %(sec)i secondes.

source: There is a mistake.
fr: Il y a une erreur.

source: Do you want to abandon the current puzzle?
fr: Voulez-vous abandonner le sudoku en cours ?

source: Retry
fr: Ré-essayer

source: The generated puzzle contains %(nb)i numbers and its level is %(difficulty)s.
fr: Le sudoku généré contient %(nb)i chiffres et est de niveau %(difficulty)s.

source: Play
fr: Jouer

source: Do you really want to start again?
fr: Voulez-vous vraiment recommencer ?

source: The grid is wrong. It cannot be solved.
fr: Il y a une erreur dans la grille, elle ne peut pas être résolue.

source: Resolution failed.
fr: La résolution a échoué.

source: Do you really want to get the solution?
fr: Voulez-vous vraiment la solution ?

source: The grid is wrong. It cannot be solved. Do you want the solution of the initial grid?
fr: Il y a une erreur dans cette grille. Elle ne peut pas être résolue. Voulez-vous la solution de la grille initiale ?

source: This is not a 9x9 sudoku grid.
fr: Ce n'est pas une grille de sudoku 9x9.

source: The file does not have the right format. It should be a .txt file with cell values separated by one space. 0 means empty cell.
fr: Ce fichier n'a pas le bon format. Ce devrait être un fichier .txt contenant les valeurs des cases séparées d'un espace, 0 pour une case vide.

source: About Sudoku-Tk
fr: À propos de Sudoku-Tk

source: Sudoku games and puzzle solver
fr: Jeu de sudoku et résolution de grilles

source: License
fr: Licence

source: Sudoku-Tk is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
fr: Sudoku-Tk est un logiciel libre ; vous pouvez le diffuser et/ou le modifier suivant les termes de la Licence Publique Générale GNU telle que publiée par la Free Software Foundation ; soit la version 3 de cette licence, soit (à votre convenance) une version ultérieure.

source: Sudoku-Tk is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
fr: Sudoku-Tk est diffusé dans l'espoir qu'il sera utile, mais SANS AUCUNE GARANTIE ; sans même une garantie implicite de COMMERCIALISATION ou d'ADÉQUATION À UN USAGE PARTICULIER. Voyez la Licence Publique Générale GNU pour plus de détails.

source: You should have received a copy of the GNU General Public License along with this program. If not, see http://www.gnu.org/licenses/.
fr: Vous devriez avoir reçu une copie de la Licence Publique Générale GNU avec ce programme. Sinon, consultez http://www.gnu.org/licenses/.

source: Sudoku-Tk Help
fr: Aide de Sudoku-Tk

source: Sudoku-Tk is a software written in python and using the Tcl/Tk graphical libraries. It enables you to play sudoku and can also solve sudoku puzzles.
fr: Sudoku-Tk est un logiciel écrit en python et utilisant les librairies graphiques Tcl/Tk. Il vous permet de jouer au sudoku et peut aussi les résoudre.

source: The puzzles can be loaded from files, entered by the user or generated by the software. I apologize for the slowness of the generation algorithm. It generates minimal puzzles, which means that if you remove any value from the puzzle it will not have a unique solution any more. See
fr: Les grilles peuvent provenir de fichier, être entrées par l'utilisateur ou générée par le logiciel. Je m'excuse de la lenteur de l'algorithme de génération. Il génère des grilles minimales, c'est-à-dire qu'il est impossible d'enlever une valeur à la grille sans perdre l'unicité de la solution. Consultez

source: https://en.wikipedia.org/wiki/Sudoku
fr: https://fr.wikipedia.org/wiki/Sudoku

source: for more information on sudoku.
fr: pour plus d'informations sur le sudoku.

source: Puzzle levels
fr: Niveaux des grilles

source: The levels given are only indicative, there might be significative variations in the difficulty of puzzles of the same level. The criteria used to define the levels are the following:
fr: Les niveaux sont seulement indicatifs, il peut y avoir des variations significatives de la difficulté des grilles d'un même niveau. Les critères utilisés pour définir les niveaux sont les suivants:

source: The puzzle is solvable using only simple elimination rules.
fr: La grille peut être résolue en utilisant uniquement des règles d'élimination simples.

source: The puzzle is solvable using more complexe elimination rules.
fr: La grille peut être résolue en utilisant des règles d'élimination plus complexes.

source: This software had to use a backtracking method to solve the puzzle.
fr: Ce logiciel a eu recours à une méthode de backtracking pour résoudre la grille.

source: Starting a game
fr: Commencer une grille

source: To start a game go to
fr: Pour commencer à jouer, aller dans

source: New -> Generate a puzzle
fr: Nouveau -> Générer une grille

source: or open an existing game / puzzle. You can also start from an empty grid.
fr: ou ouvrez un jeu ou une grille déjà existant. Vous pouvez aussi partir d'une grille vide.

source: You can find puzzles files in the
fr: Vous pourrez trouver des grilles dans le dossier

source: Filling the grid
fr: Remplir la grille

source: • Left mouse click in the cell to show the keypad to enter a value.
fr: • Clic gauche dans une case pour afficher le pavé numérique permettant d'entrer un chiffre.

source: • Right mouse click in the cell to show the keypad to enter a possibility.
fr: • Clic droit dans une case pour afficher le pavé numérique permettant d'entrer une possibilité.

source: Clicking on a number already in the cell removes it.
fr: Cliquer sur un nombre déjà présent dans la case l'efface.

source: The game can be saved at any time to continue it later. To open a saved game, go to
fr: Le jeu peut être enregistré à tout moment pour le continuer plus tard. Pour ouvrir une partie enregistrée, allez dans

source: Open -> Game
fr: Ouvrir -> Jeu

source: and select the desired .sudoku file.
fr: et sélectionnez le fichier .sudoku de votre choix.

source: Printing a puzzle
fr: Imprimer une grille

source: You cannot print directly a puzzle but you can export it as .png or .jpg in order to put several puzzles in a document editor of your choice and print them.
fr: Il est impossible d'imprimer une grille directement. En revanche, vous pouvez l'exporter au format .png ou .jpg afin de mettre plusieurs grilles sur une page depuis l'éditeur de texte de votre choix avant de l'imprimer.

source: Only the values are printed (not the possibilities) and to save ink, there is no grey background for the initial values.
fr: Seuls les chiffres seront exportés (pas les possibilités) et pour économiser de l'encre, le fond gris des chiffres initiaux est supprimé.

source: Solving a puzzle
fr: Obtenir la solution d'une grille

source: The
fr: La commande

source: Game -> Solve
fr: Jeu -> Résoudre

source: command in the menubar computes the solution of the current puzzle. First, it takes into account all the values in the grid, but if there is a mistake, the solution can be computed from the initial values only. In this case, the right value will be displayed in red in the cells that contained a wrong value.
fr: dans la barre de menu calcule la solution du sudoku en cours. Dans un premier temps, elle prend en compte tous les chiffres de la grille. Mais, s'il y a une erreur, la solution peut être calculer à partir des seuls chiffres initiaux. Dans ce cas le chiffre correct sera affiché en rouge dans les cases qui contenaient une erreur.
